In [207]:
import warnings 
warnings.filterwarnings("ignore")

import pandas as pd
import numpy as np
import missingno as mno
import matplotlib.pyplot as plt
import seaborn as sns

In [208]:
data = pd.read_csv("../data/realtor-data.csv")

In [209]:
data.head(2)

,status,price,bed,bath,acre_lot,full_address,street,city,state,zip_code,house_size,sold_date
0,for_sale,105000.0,3.0,2.0,0.12,"Sector Yahuecas Titulo # V84, Adjuntas, PR, 00601",Sector Yahuecas Titulo # V84,Adjuntas,Puerto Rico,601.0,920.0,NaN
1,for_sale,80000.0,4.0,2.0,0.08,"Km 78 9 Carr # 135, Adjuntas, PR, 00601",Km 78 9 Carr # 135,Adjuntas,Puerto Rico,601.0,1527.0,NaN

In [210]:
data.drop_duplicates(inplace=True)
data.reset_index(inplace=True,drop=True)

In [211]:
data.drop(["full_address","street","status","sold_date"],1,inplace=True)

In [212]:
data.head()

,price,bed,bath,acre_lot,city,state,zip_code,house_size
0,105000.0,3.0,2.0,0.12,Adjuntas,Puerto Rico,601.0,920.0
1,80000.0,4.0,2.0,0.08,Adjuntas,Puerto Rico,601.0,1527.0
2,67000.0,2.0,1.0,0.15,Juana Diaz,Puerto Rico,795.0,748.0
3,145000.0,4.0,2.0,0.10,Ponce,Puerto Rico,731.0,1800.0
4,65000.0,6.0,2.0,0.05,Mayaguez,Puerto Rico,680.0,NaN

In [213]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 109497 entries, 0 to 109496
Data columns (total 8 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   price       109479 non-null  float64
 1   bed         92554 non-null   float64
 2   bath        93653 non-null   float64
 3   acre_lot    79676 non-null   float64
 4   city        109475 non-null  object
 5   state       109497 non-null  object
 6   zip_code    109465 non-null  float64
 7   house_size  74345 non-null   float64
dtypes: float64(6), object(2)
memory usage: 6.7+ MB

In [214]:
data.state.nunique(),data.zip_code.nunique(),data.city.nunique()

(18, 3118, 2461)

In [215]:
data.dropna(inplace=True)

In [216]:
data.state.nunique(),data.zip_code.nunique(),data.city.nunique()

(14, 2915, 2199)

In [221]:
data.zip_code = data.zip_code.astype(int)

In [222]:
data.head()

,price,bed,bath,acre_lot,city,state,zip_code,house_size
0,105000.0,3.0,2.0,0.12,Adjuntas,Puerto Rico,601,920.0
1,80000.0,4.0,2.0,0.08,Adjuntas,Puerto Rico,601,1527.0
2,67000.0,2.0,1.0,0.15,Juana Diaz,Puerto Rico,795,748.0
3,145000.0,4.0,2.0,0.10,Ponce,Puerto Rico,731,1800.0
4,179000.0,4.0,3.0,0.46,San Sebastian,Puerto Rico,612,2520.0